Autodesk.Revit.UI.RadioButtonGroup.GetItems
Gets the collection of ToggleButtons assigned to the RadioButtonGroup.
Remarks: This is a copy of all the ToggleButtons assigned to this group.
Since: 2011

Autodesk.Revit.UI.RadioButtonGroup.AddItems(System.Collections.Generic.IList{Autodesk.Revit.UI.ToggleButtonData})
Adds new ToggleButtons to the RadioButtonGroup.
buttonData: A list of objects containing the data needed to construct the ToggleButtons.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when buttonData is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when button with buttonData.Name already exists in the group.
Returns:  The newly added ToggleButtons.
Since: 2011

Autodesk.Revit.UI.RadioButtonGroup.AddItem(Autodesk.Revit.UI.ToggleButtonData)
Adds a new ToggleButton to the RadioButtonGroup.
buttonData: An object containing the data needed to construct the ToggleButton.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when buttonData is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when button with buttonData.Name already exists in the group.
Returns:  The newly added ToggleButton.
Since: 2011

Autodesk.Revit.UI.RadioButtonGroup.Current
Gets or sets the current checked ToggleButton of the RadioButtonGroup.
Remarks:
The default value is the first ToggleButton added to the group.
When using this property to set the current ToggleButton, the external command of that button will not be called.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when trying to set this property to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when trying to set this property to a button not in this group.
Since: 2011

Autodesk.Revit.UI.RadioButtonGroup
Represents a group of related buttons in the Ribbon.
Remarks:
This class contains a collection of ToggleButtons. Only one of the ToggleButtons will appear active at a given time.
When a different button is clicked in the UI the current ToggleButton will be changed, and the ToggleButton's external command will be invoked.
Use of this class is not supported in Revit Macros.
Since: 2011